[{"Title":"Vi elsker Windows","Speakers":"Speakers: Rasmus Hald, Louise Harders","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"Win2001","Location":"Sal 5","Description":"Windows er under konstant udvikling og Microsoft har et laserskarpt fokus på at levere den bedste brugeroplevelse uden at gå på kompromis med den funktionalitet som virksomhederne forventer. Kom og vær med når Windows Produktchef Louise Harders og Teknisk Evangelist, Rasmus Hald, giver dig et unikt indblik i hvad Windows kan og hvor Windows er på vej hen..... Og ja, de elsker også Windows Vi har samlet nogle af de skarpeste Windows folk i Danmark og stiller op til Q&A paneldiskussion sidst i sessionen. Kom og lær om Windows til mennesker og virksomheder. Hør mere om sammenhængen mellem Windows, Windows Phone og Windows RT. Se de bedste Windows Tablets, telefoner og laptops til virksomheder.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win2001","Track":"Windows Client","TrackCode":"win"},{"Title":"Leverage Office 365 to maximize mobility with EMS","Speakers":"Speakers: Simon May","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"Win3004","Location":"Sal 5","Description":"Microsoft Enterprise Mobility Suite lets you embrace mobile-first cloud-ready devices and services and it complements Office 365 and your existing on-premises workloads seamlessly. In this session we'll take a typical Office 365 deployment (read that as Office 365 with DirSync and AD FS) and add EMS services (Windows Intune and Configuration Manager, Azure Active Directory Premium and Azure RMS). By the end of the session you'll see how to quickly start a pilot capabilities available with EMS. During this session we will configure, Windows Intune and Configuration Manager 2012 R2 to enable MDM and MAM, enable Azure Active Directory to enable MFA for 3rd party apps and more.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win3004","Track":"Windows Client","TrackCode":"win"},{"Title":"Why aren’t you getting 10Gbps from your physical and virtual NICs?","Speakers":"Speakers: Craig Forster, Jan Ahrenkiel Mortensen","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"Data30011","Location":"Sal 1","Description":"10Gbps NICs are becoming prevalent in servers, particularly converged networks. Yet customers aren't seeing a 10x improvement over 1Gbps NICs. In this session we'll discuss RSS, VMQ, vRSS, dVMQ, NIC teaming and some surprising external factors which are causing confusion and low throughput. There will be loads of demonstrations on high-end servers and a breakdown of a complex trace to show you how to find bottlenecks on your servers.Decrease support calls relating to missing or misconfigured RSS/VMQ settings. Prevent customers from seeing Windows as the bottleneck. Increase uptake of Windows Server 2012 (+R2) by exposing improvements in NIC Teaming, Hyper-V and Private Cloud deployments.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30011","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"What’s new for Storage in Windows Server Technical Preview and SCVMM","Speakers":"Speakers: Craig Forster, Anders Ravnholt","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"Data30010","Location":"Sal 1","Description":"Heard about \"Software Defined Storage\"? Then this is a must-see session! Come learn what's new with Windows Server Storage Spaces, Storage Replica and more.Learn the technical details that is required to manage your Datacenter with System Center Virtual Machine Manager (SCVMM).","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30010","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Virtual Machine Manager","Speakers":"Speakers: Kristian Nese","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"Data3009","Location":"Sal 1","Description":"To manage your datacenter at scale while leveraging standard-based managemend with VMM you need to know how things are designed and connected together. This session will give you the insight on the capabilities of VMM and more important; learn you how to use them to achieve a desired state configuration of your management stamp. In the end of the day, VMM is responsible for your entire datacenter while ensuring that new cloud deployments are healthy and happy.Learn the technical details that is requred to manage your datacenter with System Center Virtual Machine Manager.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3009","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Geo redundant datacenter med Hyper-V Replica og Azure Site Recovery","Speakers":"Speakers: Flemming Riis","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"Data3008","Location":"Sal 1","Description":"Kom og se når Microsoft MVP, Flemming Riis giver dig en grundig gennemgang af hvordan man bygger et geo redundant datacenter med Hyper-V Replica og Azure Site Recovery. I denne demo-intensive session vil du høre om design principperne bag løsningen, opleve hvilke muligheder løsningen giver samt få et unikt indblik i hvordan du kommer godt i gang med at etablere dit geo redundante datacenter.Lær om hvordan Hyper-V Replica, System Center Virtual Machine Manager og Azure Site Recovery kan give dig geo redundante applikationer og datacentre.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3008","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Building Azure Remote App","Speakers":"Speakers: Morgan Simonsen","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Data3007","Location":"Sal 2","Description":"Microsoft RemoteApp greatly simplifies application delivery. Using the technology of Terminal Services, now called Remote Desktop Services, you can deliver your Windows applications from an Azure datacenter to almost any device, paying as you go for only the capacity you need, and without having to design, implement or maintain the service yourself. It's Remote Desktop-as-a-Service (RDaaS). This sessions will take you through the whole RemoteApp experience; from setup to user experience. ...learn what Azure RemotApp is, how it works, how to set it up and how I can use it to deliver applications to all my users on all devices..","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3007","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"AD er dødt, AD længe leve","Speakers":"Speakers: Gustav Kaleta, Torben Nelausen","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"Data3003","Location":"Sal 1","Description":"Microsoft Azure Active Directory (MAAD) premium is THE connection between your AD, LDAP stores and Cloud Apps. We´ll walk you through on how you can discover what SaaS applications your users are running and show how you can take control back into IT from an Identity management point of view. This will include Multi Factor Authentication (MFA), selfservice Password reset, Rights Management, and Forefront Idendity Management (FIM). The objective of this session is to present Azure AD premium and all its features and functions.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/AD-er-d-dt-AD-l-nge-leve-Identity-management-Password-reset-Multi-Factor-authentication-I-skyen-i-Da","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Protecting modern datacenter workloads with  System Center Data Protection Manager","Speakers":"Speakers: Flemming Riis","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Data3002","Location":"Sal 1","Description":"Kom og lær hvordan du bruger Microsoft System Center Data Protection Manager til at beskytte applikationer og service I dit datacenter når Microsoft MVP Flemming Riis giver dig en dyb teknisk gennemgang af hvad løsningen kan (og ikke kan).På denne session får du en grundig gennnemgang af System Center Data Protection Manager","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3002","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Enterprise Mode for Internet Explorer 11 Forbedret webapp og website kompatibilitet","Speakers":"Speakers: Jesper Nielsen","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"Win30011","Location":"Sal 5","Description":"Med Enterprise Mode for Windows Internet Explorer 11 har Microsoft givet os langt bedre et værktøjer og muligheden for håndtere kompatibilitet på en meget dynamisk måde med central management. Vi vil i løbet af sessionen grave ned i lagene for Enterprise Mode for Windows Internet Explorer 11 og vise hvordan du kan håndtere kompatibilitet i den seneste version af Internet Explorer og gøre dig uafhængig af ældre browsere og give dine brugere den samme browserversion på alle platforme. Enterprise Mode for Internet Explorer 11 (EMIE) er et sæt af kompatibilitetsindstillinger i browserkonfigurationen, der er designet til at emulere Internet Explorer 8. Med Enterprise Mode for Internet Explorer 11 har it-afdelingen dermed endelig fået en mulighed for at give brugerne samme oplevelse på tværs af platforme ved at opgradere Microsoft Internet-browser til den nyeste version i hele virksomheden og samtidigt håndtere kompatibilitet med ældre webapplikationer i langt højere grad end tidligere på en langt mere smidig måde.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win30011","Track":"Windows Client","TrackCode":"win"},{"Title":"Optimizing App-V 5.0 and UE-V 2.0 for Virtual Environments","Speakers":"Speakers: Kim Kaae","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"Win30010","Location":"Sal 5","Description":"Learn how to leverage Virtual Environments (VDI and RDS) more effectively using App-V & UE-V. Virtual environments offer huge advantages in cost savings, maintenance etc. Come join us in a deep dive into the recommended practices for leveraging these products to make even smaller and more agile Golden Images and ways to optimize Virtual Environments user experience more seamless and efficient utilizing App-V & UE-V as well as to discuss the improvements in the most recent versions.This Session will provide insight of how to leverage App-V and UE-V in virtual environments.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win30010","Track":"Windows Client","TrackCode":"win"},{"Title":"What’s New and Upcoming with OS Deployment in SCCM and MDT","Speakers":"Speakers: Ronni Pedersen","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"Win3006","Location":"Sal 5","Description":"Meet deployment geek Ronni Pedersen talking about how to build fully automated Windows deployment solutions using System Center Configuration Manager (SCCM) and the Microsoft Deployment Toolkit (MDT). This session covers real-world experience and lots of notes from the fields on how to successfully deploy Windows, including drivers, updates and applications. This session also covers some of the future improvements for deployment and upgrade in the NeXT versions of SCCM, MDT, and Windows. Learn how Microsoft is gearing up to make the deployment and upgrade of the next version of Windows on SCCM the easiest yet.If you're working with Windows deployment, this is the session that you cannot afford to miss.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win3006","Track":"Windows Client","TrackCode":"win"},{"Title":"Migrating from Home Drives and Offline Files to Work Folders and Web Application Proxy","Speakers":"Speakers: Craig Forster","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"Win3003","Location":"Sal 5","Description":"Join Premier Field Engineers as we take both Windows 7 and Windows 8.1 clients that have traditional Home Drives and have their contents cached by Offline Files and migrate them to Work Folders on Windows Server 2012 R2. In this session, we will install and configure Work Folders on the file server and configure a new ADFS server then add a Web Application Proxy server in the extranet. We will then transition the clients and enable secure synchronisation of Work Folders over the internet. This session will be one continuous demo which walks you through what will be a very common scenario for IT Pros.How to do a real-life migration from traditional file servers to Work Folders using WAP Deploy 2012 R2 servers as File Servers Start deployment of ADFS and WAP – required for Azure/O365 uptake.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win3003","Track":"Windows Client","TrackCode":"win"},{"Title":"Power BI Visualization – Hands on","Speakers":"Speakers: Jens Vestergaard","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"SQL2008","Location":"Sal 10","Description":"This session will provide a high-level overview of a subset of the Power BI tools published by Microsoft in Office 365. Attending this session, you will see a live demonstration of a Business Analytics scenario using Microsoft Power BI based on Big Data. Included tools will be SQL Server, Power Pivot, Power View and Power Map.The objective of this session is to introduce a subset of the new features in Power BI: Power Pivot and in particular Power Map.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL2008","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Performancetuning for ”The Accidental DBA”","Speakers":"Speakers: Rasmus Glibstrup","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"SQL3005","Location":"Sal 10","Description":"Er du også \"ham der står for SQL Server\" uden helt at vide hvordan du skal gribe performance tuning an? I denne session gennemgås de værktøjer som er indbygget i SQL Server 2014, og der gives en række gode råd og vejledninger til hvordan man i praksis kan opnå en god løbende performance på sin SQL Server.På denne session får tilhøreren en praktisk tilgang og forståelse for de grundliggende værktøjer og metoder til performance tuning af SQL Server.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL3005","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Introduktion til Microsoft Universal Communications","Speakers":"Speakers: Mikkel Bach Nielsen","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"UC1004","Location":"Sal 6","Description":"Visionen for Universal CommunicationsOverblik og demoRoadmapOrganisatorisk forankring: Hvordan sikrer du at brugerne bliver Lync-fans?Deltagerne får et overblik over Microsofts UC-løsning og de muligheder den giver nu - og i morgen. Samtidig får deltageren også en række gode råd til hvordan løsningen bliver solidt forankret hos brugerne.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC1004","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"SCOM i den perfekte verden eller: Få fuldt udbytte af din SCOM installation og Indfri dine kollegers forventninger","Speakers":"Speakers: Kåre Rude Andersen","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"Data30012","Location":"Sal 2","Description":"Få inspiration til at præsentere dine Applikationer og services med Operations Manager 2012 R2. Mulighederne er mangfoldige når du skal henvende dig til de forskellige lag i organisationen. Din Help Desk ønsker alarmer, Applikations ejere vil se status og organisationen vil have sit eget dashboard.Se hvordan Microsoft Azure hjælper dig med Azure Operational Insights eller \"SCOM i Skyen\", vi kigger på hvordan du kan få den bedste monitorering af din lokale/hybrid eller Azure implementering.Se hvordan IT organisationer drager fordele af de nye dashboards widgets i SCOM samt hvordan du via PowerShell og SDK'et kan få præsenteret dine services til din organisation. På denne session får du inspiration til at præsentere dine Services.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30012","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Configuration Manager 2012 – A Site Review","Speakers":"Speakers: Kent Agerlund","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"Data30013","Location":"Sal 1","Description":"Ever experienced sluggish ConfigMgr administrator console performance or collections taking forever to refresh? Join Kent Agerlund as he will walk you thru a ConfigMgr site review and reveal why so many ConfigMgr installations don't perform as they should. This sessions will be packed with tips and tricks, SQL secrets and PowerShell scripts that will optimize your environment and bring ConfigMgr into the state it was supposed to be from the beginning.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30013","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Powershell hvad er nyt i v5","Speakers":"Speakers: Claus Nielsen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"Data30015","Location":"Sal 2","Description":"Hvad er nyt i Powershell v5, vi kommer blandt andet til at kigge på Desired State Configuration samt OneGet.Få en forståelse for hvad der er nyt I Powershell v5 og hvad man kan bruge det til.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30015","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"System Center Orchestrator 2012 R2 & Windows Azure Pack – Introduktion til Service Management Automation","Speakers":"Speakers: Jakob Gottlieb Svendsen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"Data30014","Location":"Sal 2","Description":"Service management automation er en ny del af System Center Orchestrator 2012 R2 og det bygger på PowerShell!Få en introduktion til systemet, mulighederne og et start-til-slut eksempel på en Runbook i SMA.Denne session bliver leveret af Jakob G. Svendsen, Co-Founder af PowerShell User Group Danmark.Du vil få en oversigt over SMA's forskellige dele og lære at lave en runbook.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30014","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"FIM 2010 – automatisering af sikkerhed og adgang","Speakers":"Speakers: Søren Granfeldt","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"Data20016","Location":"Sal 2","Description":"Kunne du tænke dig at automatisere brugerstyring i din infrastruktur? Kom og hør, hvad Forefront Identity Manager 2010 (FIM) er og oplev, hvordan FIM kan hjælpe dig med at sætte strøm til processerne omkring brugeroprettelse og tildeling af rettigheder i systemer. Hør idéer og erfaringer fra andre FIM projekter hos større og mindre virksomheder. Vi løfter også lidt af sløret for næste version af FIM – Microsoft Identity Manager (MIM).Denne session vil udbrede kendskabet til FIM","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data20016","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Mastering Networking in VMM","Speakers":"Speakers: Kristian Nese","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"Data30017","Location":"Sal 2","Description":"Understanding, designing and implementing networking in VMM might be a complex task. Especially when you add new capabilities, introduced in Windows Server Hyper-V such as LBFO, NVGRE and other elements in the SDN world. This session will guide you through it all. You will learn how to model your networks, which networks to use when, and how to implement it. Learn about key elements such as network virtualization with NVGRE, virtualization gateways and hosts, and how things should be exposed to your tenants accessing the clouds in VMM through Windows Azure Pack.Understand VMM networking and what design decision should be taken in real world deployment to support scalability, business requirements and business continuity.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30017","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Opgrader til SQL Server 2014","Speakers":"Speakers: David Peter Hansen","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"SQL3002","Location":"Sal 10","Description":"Går du med overvejelser om at opgradere til SQL Server 2014? Kunne du godt tænke dig at vide hvilke overvejelser du bør gøre dig inden? Vil du gerne have en teknisk gennemgang om hvordan man bør konfigure SQL Server 2014 for at opnå den bedste performance? Så kig forbi denne session og hør David Peter Hansen, Danmarks eneste Microsoft Certified Master indenfor SQL Server, fortælle om hvordan vi opgraderede til SQL Server 2014 hos en større international humanitær organisation med hovedsæde i København. På en time vil du lære hvordan du migrerer fra en tidligere version af SQL Server til 2014, hvordan du opnår bedst performance på dit eksisterende workload, og hvilke ting du bør overveje ved en opgradering. Ved at deltage i denne session vil du lære hvordan du smertefrit opgraderer og konfigurerer SQL Server 2014 for at opnå bedst performance.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL3002","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Beyond the Hype: Manage, Govern, and Reduce Risk of Microsoft Office 365","Speakers":"Speakers: Dennis Hobmaier","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"Prod30010","Location":"Sal 4","Description":"Microsoft SharePoint content. Now that your business has made the decision to incorporate cloud computing into your enterprise collaboration initiative, how does this affect your governance and management strategies? As cloud providers typically limit the amount of control we have over our enterprise data and applications depending on the subscription model, we'll have to revisit how management controls are implemented and maintained. In this session, we'll review strategies and tools for ensuring your cloud-hosted SharePoint, Exchange, Lync, and OneDrive content remains protected and wellmanaged. Attendees will walk away understanding best practices, strategies, and tools for managing and protecting cloud-hosted users and content, ensuring you remain in compliance with your governance policies – no matter where your content resides.Review top use cases for incorporating the cloud into your enterprise architecture and the management requirements associated with eachReview potential limitations of management solutions and strategies depending on the cloud provider and serviceUnderstand best practices, strategies, and tools to ensure your cloud-hosted content and users remains protected and well-managedReview top use cases for incorporating the cloud into your enterprise architecture and the management requirements associated with eachReview potential limitations of management solutions and strategies depending on the cloud provider and serviceUnderstand best practices, strategies, and tools to ensure your cloud-hosted content and users remains protected and well-managed","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod30010","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"SQL Server 2014 In-Memory teknologi","Speakers":"Speakers: Cartsten Saastamoinen-Jakobsen","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"SQL3001","Location":"Sal 10","Description":"Med dette indlæg vil vi gå bag om teorien bag In-Memory tabeller. Vi vil se på såvel fordelene ved at placere tabeller In-Memory, som de faldgrupper, der er ved anvendelsen. Desuden vil der være fokus på indeksering af In-Memory tabeller. Hvornår skal der anvendes hash index og hvornår er nonclustered index bedre.Efter sessionen vil du kende til teorien bag In-Memory tabeller, samt have viden om fordele og ulemper ved anvendelsen.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL3001","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Office 365 – Federation","Speakers":"Speakers: Jesper Krogh","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"Prod30011","Location":"Sal 4","Description":"Kom til denne session og lær hvorledes du smart laver Office 365 Federation, herunder hvorledes du konfigurerer WAP, ADFS 3.0.Denne session giver dig mulighed for, at dykke ned i de forskellige muligheder for federation i Office 365 – således, at du efterfølgende har overblikket over Federation – og ved hvad du skal implementere.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod30011","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Microsoft Power BI – Business Intelligence like you HAVE NEVER SEEN BEFORE","Speakers":"Speakers: Allan Rocha","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Prod3009","Location":"Sal 4","Description":"Gain insight into Microsoft Power BI and a piece of the world of project and portfolio reporting. Learn how get your Power BI in Office365 up running and ready to provide unlimited dashboards.Explain All Power Terms: Power BI, Power Query, Power Pivot, Power View, Power Map.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3009","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Whats new in Outlook 2013 and Outlook Web  App?","Speakers":"Speakers: Ella Parkum","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"Prod3008","Location":"Sal 4","Description":"Outlook is focused on providing the best experience for Office 365 subscription customers.MAPI/HTTP: Faster Connect Times to Exchange; designed for wireless and remote connectivity.Authentication: Outlook Web App and Outlook will provide multi-factor authentication During this session new features in Outlook 2013 will be demonstrated. We will also cover MAPI over HTTPBy attending this session you will learn about new productivity improvements in Outlook 2013.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3008","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Office 365 – Produktivitet","Speakers":"Speakers: Henrik Kim Christensen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"Prod2007","Location":"Sal 4","Description":"Kom og se live demoer af Office 365 og hvordan de mange produkter smelter sammen og kan anvendes til dagligdagsarbejde, hvor dokumenter deles og redigeres, online møder afholdes og mange forskellige enheder benyttes. Demoerne suppleres med gennemgang og forklaring af den underliggende teknologi og infrastruktur og med bud på, de mange forskellige muligheder for at udrulle det i danske virksomheder.Forstå Microsoft vision for Productitvity, og hvordan Office 365 leverer på denne vision gennem konkrete demoer og dagligdagseksempler.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod2007","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Advanced Sharepoint governance","Speakers":"Speakers: Anders B. Skjønaa","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"Prod3006","Location":"Sal 4","Description":"The key to success with SharePoint is the ability to support changing requirements with a flexible and solid service platform. This has proven to be hard without a well implemented governance practice. Many organization have tried implementing governance with SharePoint, but keeping a sharp focus is a challenge and often good intensions are never realized. Why is it so hard to make governance work? In this session you will learn about new methods and tools to run a successful governance practice for SharePoint. We will take a deep dive into the details of Building catalogues of managed systems and talk through how policies and controls are to be designed to work in the real world. Presuming you know the importance of governance by coming to this session, the speaker will present you with hands-on tools and methods that you can put to Work right away. This is an advanced governance session primarily aimed at Service Owners, Service Delivery Managers, Architects and System Administrators.By attending this session you will get detailed knowledge about designing, implementing and driving an operation governance practice for SharePoint. I will get introduced to specific tools and methods that can help me practice successful governance in my Company.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3006","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"SharePoint Environments As A Service","Speakers":"Speakers: Peter Brinch Larsen","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"Prod2005","Location":"Sal 4","Description":"I SharePoint projekter er Application Lifecycle Management en naturlig del af projektet for at tilsikre høj kvalitet og en robust applikation som er let at vedligeholde efter projektet er færdiggjort. Men man overser ofte at det er vigtigt at behandle sin SharePoint infrastruktur på samme agile måde hvis man ønsker en solid løsning hvor det er let at lave nye miljøer samt disaster recovery. Jeg oplever desværre stadig mange projekter håndterer selve SharePoint infrastrukturen og opsætningen af Service Applikationer som en vandfalds-tilgang eller big-bang approach. Det gør man opdager nogle uhensigtsmæssigheder meget sent i udviklingsprojektet, og til tider først i produktion. En udfordring tidligere har været at det måske har været svært at tænke infrastruktur agilt, fordi det er noget der har taget flere måneder at få plads. Men det er ingen undskyldning længere med Azure. I denne session vil du blive udfordret på hvordan du tænker infrastruktur i dag, samt demonstrere hvordan man kan benytte Azure IaaS i sine daglige builds.I denne session vil du få den nødvendige viden og inspiration til at komme i gang med at udnytte Azures IaaS muligheder i en SharePoint kontekst.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3005","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Automatiserede SharePoint Deployments","Speakers":"Speakers: Bernd Rickenberg","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"Prod3004","Location":"Sal 4","Description":"Har du brug for at automatisere dine SharePoint deployments? Arbejder du med SharePoint 2010, 2013 eller SharePoint Online? Denne session giver dig indblik i, hvordan du kan bruge open-source projektet SPSD (SharePoint Solution Deployer) fra Codeplex til at få styr på dine SharePoint deployments.SPSD er skrevet i PowerShell og har mange udvidelsesmuligheder. SPSD har en fleksibel og let genbrugelige XML konfiguration, som nemt kan deploye til diverse udviklings- og staging miljøer. Siden 2012 har SPSD været brugt til at deploye mange SharePoint løsninger.Sessionen giver et overblik over SPSDs features, og gennemgår detaljeret konfigurationsmulighederne. Undervejs viser jeg deployment af WSP pakker, SPA (single page application) og SharePoint 2013 workflows.Vi tager et dybere kig i udvidelsesinterfacet, og mulighederne for at du kan tilpasse SPSD til dine behov. SPSD ligger på GitHub, og alle kan bidrage til projektet.Til sidst kigger vi på integration i Visual Studio og Team Build.Sessionen giver dig en introduktion til de typiske udfordringer ved SharePoint deployments, og et overblik over open-source værktøjet SPSDs muligheder og begrænsninger for at afhjælpe disse. Efter sessionen kan du direkte gå i gang med at bruge det til egne projekter, og du har fået inspiration til, hvordan du får mest ud af værktøjet.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3004","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"SharePoint App Architecture for the Cloud and on-premise","Speakers":"Speakers: Sonja Madsen","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"Prod3003","Location":"Sal 4","Description":"Kom og få indsigt i server funktionalitet og code-behind på Office 365. Jeg viser en Projektweb Cloud app som kan oprette sites på Office 365 som en eksempel på potentiale som den nye app model bringer til skyen.Jeg kommer til at vise hvor nemt det er at sætte en udviklingsmiljø op, og hvad skal der til at få C# code til at fungere i en Projektweb Cloud app i forhold til hvad man er vant til med SharePoint farm løsninger. Jeg viser kort den nye løsningspakke fra Office App Model Samples Team, og afslutter med en gennemgang af hvordan man får den samme app kan komme til at køre på SharePoint on-premise.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod3003","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Release Management - Continuous integration & Delivery","Speakers":"Speakers: Phillip Haugaard","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"VS2005","Location":"Sal 7","Description":"Learn about Release Management for Visual Studio 2013 and its suite of release and deployment tools that automate the deployment of applications across the desktop, server, and the cloud. Release Management for Visual Studio 2013 helps development and operations teams integrate with Team Foundation Server 2013 to configure and automate complex deployments of their automated builds to target environments more easily. I will demonstrate practical usage ofRelease manager for developers, testers, operations and project stakeholders and show how this tool is used to form a DevOps pipeline for Continuous integration & Delivery. This session will show the potential of Release Manager in controlling the delivery pipeline.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS2005","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Making Magic with F# Type Providers","Speakers":"Speakers: Don Syme","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"VS2004","Location":"Sal 7","Description":"Do you want programming languages which making JSON data simple? Which scale to internet-scale information sources like data markets and the Bing and Google Knowledge Graphs? Which allow you to integrate all the information spaces of the modern enterprise? The modern world is highly information rich, but our programming languages are information sparse, especially our strongly typed ones. \"Information Rich Programming\" (IRP) is an emerging direction for strongly-typed language design and implementation, and the innovative F# language from Microsoft is leading the way in this area. Can we gives types to \"everything\", and if so, should we? What does it mean for future languages? We'll demonstrate what F# 3.0 specifically offers in the area of IRP,a magical blend of programming and data.Inspire all programmers and data engineers, and educate potential F# users","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS2004","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Spring infrastrukturen over med Visual Studio Online","Speakers":"Speakers: Jeppe Lund Andersen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"VS3003","Location":"Sal 7","Description":"Visual Studio Online blev lanceret for knap et år siden og der er allerede sket en del siden.VSO tilbyder idag en lang række tjenester så man selv slipper for at skulle vedligeholde infra-strukturen til sine udviklingsprojekter. For nye til VSO, ser vi på fem ting der kan tages i brug iløbet af kort tid, som versionsstyring, opgavestyring, build services, load test og analytics.Derudover ser vi på nogle af de nye ting der er kommet til siden sidst, som CodeLens, REST API og integration med Azure Active Directory.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3003","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Kundecase: Islands Politi","Speakers":"Speakers: Thomas Martinsen, Jon Bille","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"VS2002","Location":"Sal 7","Description":"Earlier this year the Icelandic Police deployed the first versions of their new Windows 8.1 app into their police cars. Several platforms and hardware solutions was in running for the final solution but in the end the Windows based solution was obvious. In Bluefragments we have been involved with the Icelandic Police from the early planning until the final steps of the deployment. A team of developers, designers and project managers from Bluefragments and the Icelandic Police build the app onsite at the Police headquarters in Iceland in just 5 days. In this talk I will give some insights into some of the business decisions made prior to building the app as well as the planning ahead of the codecamp. I will provide some valuable insight into the concept behind the codecamp, how we managed to get it to succeed and about the tools and the processes we used. Finally I will go through some of the technical issues we solved during the codecamp and how we tested and deployed the final solution.During the talk there will be time for additional demonstrations and questions.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS2002","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Fleksibel version kontrol med GIT og TFS","Speakers":"Speakers: Jørn Floor Andersen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"VS3001","Location":"Sal 7","Description":"Earlier this year the Icelandic Police deployed the first versions of their new Windows 8.1 app into TFS version control bliver ved med at udvikle sig. En hel ny del, der er kommet til i de sidste versioner er Git-support. Det giver nye muligheder for at integrere eks versionskontrol af app- udvikling på Ikke-Microsoft platforme som eks IOS/XCODE ind i TFS. Samtidig stiller det nye krav til projekter om valg af versionskontrol: Distribueret overfor Centralt og fordele pog ulemper ved dette.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3001","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Fremtidens ASP.NET (vNext)","Speakers":"Speakers: Stig Irming-Pedersen","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Web3009","Location":"Sal 3","Description":"Udviklingen af fremtidens ASP.NET er i fuld gang og der er fundamentale ændringer på vej:Web sites og services smelter sammen i MVC 6, udvikleroplevelsen flyver med Roslyn,deployment når skyerne med .NET Core og afviklingen bliver frigjort med K! I denne sessionintroduceres visionen for ASP.NET vNext og der gives et konkret indblik i den aktuelle statusfor projektet. Vi vil se nærmere på de centrale tekniske områder fra en udviklers perspektiv,og om muligt prøve dem af i praksis. Bemærk: Præsentationen vil tage udgangspunkt ipre-release software og der vil blive vist kodeeksempler i den kommende version af VisualStudio (\"14 CTP\").Kom foran og vær med på den nye bølge inden for ASP.NET. De nye features i vNext vil bringeen masse fordele til udvikleren med sig, og i denne session vil man lære om hvordan manudnytter dem bedst muligt og kan bruge det i sin egen hverdag.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web3009","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Design cloud-native dokumentdatabaser med den spritnye service Microsoft Azure DocumentDB!","Speakers":"Speakers: Jimmy Tønners","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"Web2008","Location":"Sal 3","Description":"Brug af NoSQL teknologi på Microsoft Azure har hidtil stillet os med valget mellem Azure Table Storage eller indkøb/drift af en tredjeparts løsning som CouchDB, MongoDB eller tilsvarende. I August måned, 2014, introducerede Microsoft en ny NoSQL teknologi i preview programmet på Azure, ved navn DocumentDB. Dette dækker over en spændende ny platform service, som vi skal se nærmere på i denne session. Med DocumentDB melder Microsoft sig ind i kampen om kunder med behov for en moderne dokument database. Præsentationen indeholder et mix mellem kode, slides og demonstration af features.Introduktion til Microsoft's nye NoSQL Dokument Database, DocumentDB. Det forventes at man, som tilhører, efter denne session har kendskab til det overordnede featuresæt, samt kan foretage en informeret beslutning om anvendelse af denne nye service..","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Design-cloud-native-dokumentdatabaser-med-den-spritnye-service-Microsoft-Azure-DocumentDB-","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Command Query Responsibility Segregation (CQRS) og Event Sourcing med Azure","Speakers":"Speakers: Mogens Heller Grabe","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"Web3006","Location":"Sal 3","Description":"CQRS og event sourcing går hånd i hånd, og hvis man ønsker at bygge skalerbare systemer med kompleks domænelogik, så tilbyder CQRS og event sourcing en model med suveræne egenskaber. I denne session vil vi kigge på d60s egenudviklede (open source og gratis!) framework, Cirqus, som stiller alle de nødvendige primitiver til rådighed for at kunne bygge systemer baseret på CQRS og event sourcing. Vi vil kigge på hvorledes et sådant system kan hostes i Azure med SQL Azure som event store, samt adskillige asynkrone read-modeller i hhv. SQL Azure, MongoDB og Blob Storage, forbundet vha. Azure Service Bus.Deltagerne vil blive bekendt med de grundlæggende principper i CQRS og event sourcing samt de arkitekturmæssige egenskaber, som gør at CQRS befinder sig ekstremt godt i et cloud- setup. Alle beskrevne principper vil blive illustreret med vaskeægte, kørende kode.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web3006","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Modulære webapplikationer med OWIN/Katana","Speakers":"Speakers: Christian Horsdal","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"Web3005","Location":"Sal 3","Description":"Vi er på vej ind i en ny verden af modulær webudvikling i .NET, og navnet på denne verden er OWIN: Open Web Interface for .NET! OWIN vil i de kommende år få en stor udbredelse og i en vigtig rolle i .NET-baserede webapplikationer – med støtte fra Open Source-community'et samt ASP.NET vNext, der er lige på trapperne. OWIN-specifikationen tilbyder en standardiseret måde, hvorpå web-servere, middleware og web-frameworks kan integrere med hinanden i et logisk system af interfaces. Med andre ord kan du bruge OWIN til at bygge præcis den web-pipeline, du ønsker. I denne session vil Christian Horsdal tale om hvorfor OWIN kom til verden, hvad det består af, og hvordan det understøtter en blanding af komponenter fra Microsoft, Open Source-community'et samt ens eget udviklingsmiljø. Christian vil demonstrere dette ved også at bygge sin egen OWIN-middleware, så du vil være i stand til at gøre det samme! Man vil som deltager få en introduktion til OWIN-specifikationen, få et overblik over det voksende OWIN-økosystem samt konkrete forslag og råd til hvordan man selv kan komme i gang med OWIN i sit webprojekt.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Modul-re-webapplikationer-med-OWIN-Katana","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Web Security - Do's and .NOT's","Speakers":"Speakers: Anders Skovsgaard","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"Web4003","Location":"Sal 3","Description":"Forretningskritiske data og tjenester bliver i stigende grad gjort tilgængelige på internettet. Men kriminelle aktiviteter på nettet er udbredt og grupperinger er ikke blege for at udnytte og offentliggøre sensitive data, hvilket gør websikkerhed til et vigtig emne. Denne præsentation handler om sikkerhed i webapplikationer med særligt fokus på ASP.NET og introducerer et antal vigtige og opdaterede sårbarheder enhver udvikler bør kende. Der bliver vist live eksempler med både rigtige og fabrikerede angreb for at demonstrere, hvad kriminelle i værste tilfælde kan gøre på en usikker side. Der vil også blive demonstreret, hvordan man kan finde sårbarheder samt givet anbefalinger til, hvordan de kan forhindres.Man vil komme i dybden med websikkerhed og lære om de mest almindelige og de farligste sikkerhedshuller på nettet. Fokus vil være på ASP.NET, og man vil få konkrete råd med hjem, som man kan implementere i sin egen webapplikation.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web4003","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Byg fremtidens skalérbare realtids-webapplikation med SignalR","Speakers":"Speakers: Rune Ibsen","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"Web4004","Location":"Sal 3","Description":"Vil du bygge et webbaseret multiplayerspil? Skal din næste LOB applikation imponere kolleger og kunder med en effektiv og livlig brugeroplevelse? Har din webapplikation brug for real-time kommunikation med sine klienter, eller glæder du dig måske bare til den dag, hvor web sockets er tilgængelige i alle browsere? Så er ASP.NET SignalR lige noget for dig! ASP.NET SignalR leverer al den omstændelige infrastruktur til denne type applikationer, så du allerede i dag kan koncentrere dig om at bygge alt det sjove! I denne præsentation vil Rune Ibsen:Beskrive de udfordringer, som real-time webapplikationer præsentererDykke ned i de blodige detaljer og vise, hvordan ASP.NET SignalR løser udfordringerne Kode et multiplayerspil undervejs!Du vil lære hvad ASP.NET SignalR er, hvordan det virker og være i stand til og have lyst til at anvende ASP.NET SignalR på dit næste projekt!","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web4004","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Tag trykket af dit eksterne API med Azure Web Sites og WebJobs","Speakers":"Speakers: Christian Dalager","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"Web3001","Location":"Sal 3","Description":"En del almindelige websites har brug for at udstille enkle API'er til deres omverden. Det kan f.eks. være leveringsnotifkationer fra email- eller SMS-services, der forventer at få et hurtigt svar tilbage. Man kan imidlertid ikke kontrollere en ekstern service, og det betyder at der kan være en risiko for at ens API en dag bliver flood'et af requests, som alle sammen vil have adgang til dine kritiske komponenter som f.eks. databasen og hvad man ellers har kørende af forretningssystemer. Christian Dalager vil i sessionen vise, hvordan man med et enkelt setup kan komme i gang med at throttle inbound integrationspunkter med Azure Websites, WebJobs og Queues.Efter sessionen vil man være i stand til at benytte sig af WebJobs og køer i skyen til at beskytte sine kritiske systemer mod request flooding.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web3001","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Byg den vildeste Recommendation Engine i skyen med Hadoop/HDInsight i Azure","Speakers":"Speakers: Sebastian Brandes","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"App3008","Location":"Sal 8","Description":"Den benhårde konkurrence blandt webshops gør, at e-købmænd og -kvinder konstant er på jagt efter muligheder for at komme foran konkurrencen. Med Hadoops stigende popularitet er det nu muligt for disse at udvikle deres egne Recommendation Engines - altså motorer, der kan generere intelligente foreslag til interesserede besøgende - baseret på deres weblog-data. Og det er interessant, fordi sådanne motorer kan påvirke bundlinjen direkte og meget positivt! I denne session vil vi tale om, hvordan man kan bruge HDInsight i Azure til at bygge sådan en motor. Vi vil komme ind på arkitekturen i sådan en løsning, og hvordan man med en lille indsats kan implementere en Recommendation Engine i sin egen virksomhed og udløse det store potentiale. Vi vil dykke ned i koden, vise konkrete eksempler og gennemgå en demo, der dækker hele scenariet fra ende til anden. Alle, der arbejder med e-handel eller med kundevendte web sites, vil kunne tage konkrete ting med hjem fra denne session og anvende disse derhjemme!Deltagere vil få en dyb forståelse for hvordan Recommendation Engines virker, og hvordan disse kan anvendes i konkrete scenarier (i denne session er der fokus på e-handel). Man vil som deltager lære om HDInsight (Hadoop) i Azure samt Azure Machine Learning og forstå disse services i dybden, så man kan bruge dem som konkrete værktøjer i sit daglige arbejde.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App3008","Track":"App Development","TrackCode":"app"},{"Title":"Universal Apps – Build once, run on every Microsoft device","Speakers":"Speakers: Kasper Hjort Holdum","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"App2006","Location":"Sal 8","Description":"With the introduction of a more unified app platform the opportunity for code reuse between platform targets have never been greater. Best-case scenarios achieve around 90% code reuse between platforms and this session will explore the techniques and structures necessary for reaching such levels of reuse. The subjects covered in this session can be applied to target multiple platforms such as Windows Phone, WPF, Windows and XBox. For Xamarin developers the principles extends to their supported platforms such as iOS and Android. Gain insight into building apps that can run on multiple platforms while maximizing code reuse.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App2006","Track":"App Development","TrackCode":"app"},{"Title":"Få din App til at virke offline","Speakers":"Speakers: Niels Ladegaard Beck","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"App3005","Location":"Sal 8","Description":"Som udvikler får man ingen annerkendelse når der mangler netværksdækning – især ikke hvis det også koster på bundlinen. 3G, 4G og WiFi - der er masser af muligheder for at komme på nettet. Men trods de mange muligheder, er der stadig mange situationer, hvor man må undvære forbindelsen til internettet. Det er træls, hvis man skal på Facebook, men kan være direkte skadeligt for salget for en virksomhed. Med Azure Mobile Services får du ikke blot adgang til dine data på en nem og sikker måde - du får også mulighed for at gøre dem tilgængelige, selvom du ikke har nogen netværksforbindelse. Der vil kun være få slides i præsentationen, da hovedparten af tiden vil tilbringes i Visual Studio.Lær at udnytte Azure Mobile Services. Udnyt Offline mulighederne, så du ikke selv skal skrive synkroniseringslogik","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App3005","Track":"App Development","TrackCode":"app"},{"Title":"Kom i gang med anvendelse af interne data i workflows I Office 365","Speakers":"Speakers: Steen Molberg","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"App2004","Location":"Sal 8","Description":"En udfordring I forbindelse med udvikling af worklows på Office 365 er anvendelse af interne oplysninger og systemer til at styre processerne i skyen. Denne session viser, hvordan man kan anvende en ny feature i Azure Web Sites til at møde denne udfordring.Man vil som deltager være i stand til at udvikle workflows til Office 365 som anvender Azure Hybrid Connections til","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App2004","Track":"App Development","TrackCode":"app"},{"Title":"Tips & Tricks til udviklingsmiljøet i Dynamics NAV 2015","Speakers":"Speakers: Peter Jakobsen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"NAV40011","Location":"Sal 9","Description":"Vi ser på nyt i udviklingsmiljøet i Dynamics NAV 2015 og samler op på de centrale fra NAV 2013 R2. Praktisk tips & tricks gennemgang med henblik på at få et bedre indblik i brugen af, samt hvordan de forskellige funktioner udnyttes mest effektivt.På session gennemgår vi nyt og forbedringer i udviklingsmiljøet fra NAV 2015 og NAV 2013 R2.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV40011","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Deploying Dynamics C5 2015 & NAV 2015 on Windows Azure","Speakers":"Speakers: Freddy Kristiansen","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"NAV3009","Location":"Sal 9","Description":"Wonder how to take Dynamics NAV or C5 to the cloud? In this session we'll show you how to deploy Dynamics NAV on Windows Azure focusing on a multi-tenant setup. We'll touch upon automating the deployment process using scripts, and give you some best practices and sizing considerations based on newly released guides and experience from the field.Well walk you through best practice for Azure deployment of Dynamics NAV.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Deploying-Dynamics-C5-2015-NAV-2015-on-Windows-Azure","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Dynamics C5 2015 & NAV 2015 som en del af Office 365","Speakers":"Speakers: Peter Jakobsen","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"NAV3008","Location":"Sal 9","Description":"Office har længe været en integreret del af Dynamics C5 & NAV. Med Office 365 åbnede der sig en ny verden af muligheder for samarbejde og anvendelse af data fra Dynamics. Vi ser på hvordan Office 365 nu er fuldt integreret med Dynamics C5 & NAV - eller er det omvendt? Vi ser desuden på installation og opsætning, der følger med at anvende integrationen til Office 365 fuldt ud - bl.a. med best practice analyser.Få indblik i den nye og forbedrende muligheder med Office 365 og Dynamics NAV","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3008","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Power BI for Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: jonathan davis","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"NAV3007","Location":"Sal 9","Description":"In need of a analysis and reporting packages - and you've already got Dynamics NAV and Excel; you're almost there! If you're familiar with Power Pivot and Power View for Excel - we'll take you one step further. Get the full value of your Dynamics data. We'll walk you through how to setup and configure your own dashboard. We'll touch on integrating via Odata too as an example of exchanging data to/from Dynamics NAV.We'll show you how to create powerfull analysis and reporting packages with Dynamics NAV and Power BI tools (Excel)","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3007","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Nyt i brugerflade og applikationen til Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: Thomas Halse","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"NAV3006","Location":"Sal 9","Description":"Med Dynamics C5 2014 blev der sat ekstra fokus på nem og hurtig betjening af applikationen. Det er der kommet en række effektive gevinster ud af. Vi gennemgår forbedringerne i brugerflade, profiler og konfiguration og ser også på en række forbedringer rundt om i applikationen.Få overblik over de forskellige forbedringer i brugerfladen, samt en gennemgang af ny og forbedret funktionalitet.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3006","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Nyt i Cash flow, Bank & Betalinger til Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: Thomas Halse","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"NAV3005","Location":"Sal 9","Description":"Med Dynamics NAV 2015 udvides og introduceres nye elementer til håndtering af elektroniske betalinger,optimering af betalingshåndtering og likviditetsstyring. Vi gennemgår eksempler og ser på de nye muligheder. Få overblik over de nye og forbedrede muligheder til likviditetsstyring, bankhåndtering og betalinger","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3005","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Protect your organization with Exchange Online Protection","Speakers":"Speakers: Peter Schmidt","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"UC3002","Location":"Sal 6","Description":"I denne vil der blive fokuseret på Exchange Online Protection (EOP) og hvordan du benytter EOP til at beskytte din virksomhed mod spam, malware, virus mm.Kom og hør om arkitekturen, konfiguration af EOP, best practice, samt demo af mulighederne.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3002","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Lync 2013 Enterprise Voice: Design af infrastruktur","Speakers":"Speakers: Jan Fredborg","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"UC3005","Location":"Sal 6","Description":"Telefoni / Enterprise Voice på Lync platformen giver mulighed for at gentænke hvorledes telefoni anvendes i virksomheden og hvordan forbindelsen til PSTN etableres. Når telefoni går fra lokal til global PBX, kan et komplet redesign være nødvendigt; skal vi lave lokale break-outs eller er en central trunk en mulig løsning?Lær om mulighederne og hør om opnåede erfaringer fra in-the-field. Deltagerne får indblik i hvordan telefoni grundlæggende håndteres af Lync. Samt de får en god forståelse for design af Lync Enterprise Voice infrastruktur inklusiv SBA","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3005","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Lync, Skype federation og SIP Trunking i praksis","Speakers":"Speakers: Dennis Lundtoft Thomsen, Peter Steen Nielsen","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"UC3006","Location":"Sal 6","Description":"Er du klar til at implementere telefoni via SIP Trunks, eller vil du høre mere om udviklingen indenfor Skypeintegrationen - så er denne session relevant for dig. Du vil se hvordan SIP trunking kan implementeres med eller uden en software Session Border Controller (SBC), og du vil høre om sikkerhedsfordele, migreringsmuligheder og kreative high availability løsninger afhængigt af dit valg. Desuden vil vi i praksis vise hvordan Inceptio har implementeret Lync med ISDN og SIP Trunking med og uden SBC. Derudover vil vi vise hvordan infrastrukturen bag Skype federation virker i den nuværende version og tale om udviklingen indenfor codecs og Skype federation.Deltagerne bliver sat ind i hvordan SIP Trunking kan implementeres i praksis, de hører om faldgruberne og ikke mindst om alle de små tips og tricks som gør implementeringen mere fleksibel og brugbar. Derudover vil de gå hjem en god fornemmelse af den nyeste udvikling indenfor Lync og Skype integrationen og de vil have set hvordan det vil påvirke Lync samt høre hvad de kan bruge det til i praksis.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3006","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Automated data upgrade in Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: septimiu turcu","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"NAV3004","Location":"Sal 9","Description":"Dynamics NAV 2015 offers you tools to automate your data upgrade process. We'll show you how setup and run the automation incl. some tips and tricks. Get an overview of how to automate data upgrade in Dynamics NAV 2015","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3004","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Document Reporting med Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: Peter Jakobsen","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"NAV3002","Location":"Sal 9","Description":"Med Document reporting til Dynamics NAV 2015 får du nye og fleksible muligheder for at tilpasse rapport-layout på en nem og effektiv måde. Med Microsoft Word som layout-lag ovenpå de traditionelle SQL RS (RDCL) rapporter kan udskrifter som f.eks. faktura hurtigt tilpasses kundens ønsker. Vi gennemgår den nye funktionalitet med udvalgte eksempler, samt tips & tricks. Vi kigger desuden på den nye mulighed for scheduled reports.Få overblik over hvordan du kan udvide rapporter i Dynamics NAV med den nye Document Reporting feature.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3002","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Vær en dynamisk virksomhed med Microsoft Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: Thomas Halse, Peter Jakobsen","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"NAV2001","Location":"Sal 9","Description":"Med den nyeste version af Microsoft Dynamics NAV - 2015, har mulighederne aldrig været bedre. En intuitiv og velkendt brugerflade, rig på funktionalitet, fleksibel og let tilgængelig - hvad enten du er på kontoret eller på farten. Med tæt integration til Office 365 og mulighed for afvikling på Windows Azure kan du reelt tage dine opgaver med dig uanset hvor du er. Vi giver dig indblik i mulighederne og ser på hvordan du kan styrke og vokse din forretning med Microsoft Dynamics NAV 2015. Bemærk, at Microsoft Dynamics C5 2015 - som den foregående version 2014, deler platform med Microsoft Dynamics NAV 2015. Vi fremhæver undervejs, hvor skellet går mellem de to løsninger. Få indblik i og inspiration til hvordan den nyeste version af Microsoft Dynamics C5 og NAV kan understøtte din forretning.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/V-r-en-dynamisk-virksomhed-med-Microsoft-Dynamics-C5-2015-NAV-2015","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Lync 2013 - Advanced Troubleshooting","Speakers":"Speakers: Thomas Juhl Olesen, Kent Rifbjerg Erichsen","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"UC40011","Location":"Sal 6","Description":"Hør i denne session om de mange forskellige tools der kan anvendes i forbindelse med troubleshooting af LYNC issues. Både indbyggede og 3. parts – med live demo. Deltagerne vil i denne session få viden om hvordan man bedst indkredser - og afhjælper - fejl og issues i et LYNC miljø med mange komponeneter. Vi vil tale om de indbyggede tools som Snooper, CLS, MSturnping, osv, men kigger også på nogle af de 3. parts tools, som vi kan give værdi. Eksempler herpå er Wireshark, RUCT, acsyslog m.v.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC40011","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Øg funktionaliteten i Lync med de tilgængelige API'er og SDK'er.","Speakers":"Speakers: Mark Petersen","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"UC30010","Location":"Sal 6","Description":"Introduktion til Lync 2013 fra et udviklerperspektiv. Hvilke forretningsmæssige fordele kan kunderne realisere ved at udvide Lync-funktionaliteten og/eller integrere Lync med andre systemer? Overblik over mulighederne i det klient-baserede SDK, men ogs�� UCMA, UCWA og nu jLync (UCJA), herunder fordele/ulemper præsenteret i relevante eksempler. Undervejs vises eksempler på løsninger udviklet af RackPeople.Deltagerne får i teori - og ved eksempler - vist hvordan standardfunktionaliteten i Lync kan udvides og hvordan Lync kan integreres ind i kundernes forretningsprocesser via Communications Enabled Business Processes (CEBP)","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC30010","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Lync sikkerhedsovervejelser","Speakers":"Speakers: Claus Jespersen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"UC3009","Location":"Sal 6","Description":"Lync bliver ofte brugt på andre devices end ens firma PC, hvilket øger kravene til sikkerheden. Sikkerhed er en af flere vigtige principper, som Lync er designet ud fra, og tanken er \"security built-in\". Alligevel viser det sig ofte, at der er andre sikkerhedsovervejelser relateret til den samlede Lync infrastruktur, som Lync ikke direkte adresserer i de nuværende versioner. Denne session vil belyse flere af disse områder. Sessionen vil bl.a. gennemgå, følgende: ADFS baseret adgangskontrol til Lync (specielt i relation til Lync Online), brug af Passive Authentication med og uden Office vNext, Pre-authentication, understøttelse af 2-faktor validering, denial of service, VPN issues relateret til brug af Lync. Sessionen vil være meget teknisk, og forudsætter en god forståelse for Microsoft infrastruktur samt Office 365. Indholdet bygger på aktuelle kundesager, hvor Microsoft har hjulpet kunder med at finde en balance mellem sikkerheden i en Lync infrastruktur, brugeroplevelsen og de funktioner, der stilles til rådighed.Få en god forståelse for aktuelle sikkerhedsovervejelser i en Lync infrastruktur, og hvordan man kan adressere dem nu og fremover.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3009","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Lync Enterprise Voice – Do's & Don’ts","Speakers":"Speakers: Jan Fredborg","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"UC3008","Location":"Sal 6","Description":"I denne session kigger vi på hvordan man laver en Lync Enterprise Voice implementering fra den lille lokale til den store globale virksomhed.Sessionen giver et indblik i nogle af de ting man bør gøre - og undlade at gøre - i forbindelse med Lync Enterprise Voice.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3008","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Office 365 – Exchange Hybrid","Speakers":"Speakers: Morten Banke","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"UC3003","Location":"Sal 6","Description":"Denne session vil fokusere på de nye muligheder der er i Exchange 2013 for at konfigurere Exchange Hybrid med flere AD forests. Dette giver nogle helt nye muligheder for at få nye firmaer på Office 365 i forbindelse med merger/acquisition scenarier.Sessionen vil give indblik i hvordan Exchange 2013 Hybrid virker og konfigureres. Der fokuseres især på de nye features i Exchange 2013 hybrid samt fejlfinding i Exchange Hybrid scenarier.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3003","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Lync and Exchange Better together","Speakers":"Speakers: Joachim Dissing, Frederik Møldrup","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"UC3007","Location":"Sal 6","Description":"I denne session vil vi kigge på hvordan du kan forbedre din produktivitet og integrere Lync med Exchange, således at du får det optimale udbytte af begge produkter når de er sammen.På sessionen vil vi forklare og vise opsætningen vha. demoer af:IM og tilgængelighed er i Outlook Web AccessTelefonsvare i Exchange 2013Telefonsvare i Office 365Brug af Unified Contact Store","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3007","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Installation considerations for Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: jonathan davis","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Nav30010","Location":"Sal 9","Description":"How to configure, size and support a live Dynamics NAV/C5 2015 environment? And what about performance? In this session we'll walk through the key elements of deploying and supporting Dynamics NAV/C5 2015 from a system administration point of view. We'll also share our thoughts on how to size and to performance optimize the solution. Please note Azure and multi-tenant deployment are covered in other sessions.This session provides you with best practice for installing and managing Dynamics NAV","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Nav30010","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Explore the Internet-of-Things with Azure","Speakers":"Speakers: Thomas Normann-Ekegren, David L. Bojsen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"SQL3003","Location":"Sal 10","Description":"The latest buzzword in relation to Data Insights and Analytics have been Big Data. However, even though the hype started some time ago – the deployment of Big Data solutions is still somewhat limited. Now the buzz is about the \"Internet-of-things\". In this session, we will talk about the Internet-of-things as an enabler for Big Data and we will dive into the Azure services that help us realize the potential of the Internet-of-Things. We will go into depth with the Azure Machine Learning platform and the Azure Intelligent Systems Services (ISS).By attending this session, you will discover what Azure Machine Learning is in comparison to Data Mining and how you can leverage the Azure platform for collecting and hosting data to gain valuable insights.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL3003","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Introduktion til Project Roslyn","Speakers":"Speakers: Henrik Lykke Nielsen","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"VS3009","Location":"Sal 7","Description":"Roslyn er Microsofts nye compiler platform. .NET udviklere får nu direkte adgang til de nyudviklede C# og VB compilere – og ikke mindst til parserne – hvilket betyder, at det bliver meget simplere at foretage eksempelvis kodeanalyse og refaktoreringer end, hvis man skulle have lavet sine egen parsere.Dette indlæg vil give en introduktion til Roslyn platformen og vise eksempler på dens anvendelse.Lær' om mulighederne en åben compiler giver digHvilke fordele Roslyn giver en udvikler i Visual Studio","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3009","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Entity Framework 7 ”Everywhere”","Speakers":"Speakers: Erik Ejlskov Jensen","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"VS20010","Location":"Sal 7","Description":"Med version 7 af Entity Framework bliver det omsider muligt at bruge EF på mobile devices (Windows Phone, Window Store og Xamarin platforme). Kom og se hvordan. Desuden kigger vi på muligheder for at synkronisere data med en central SQL Server til brug i en rigtig \"end-to-end\" offline applikation.Get an overview of the scenarios that EF7 on mobile devices enable, and learn about tools to synchronize with SQL Server","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS20010","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Deep Dive: MVVM og Universal Apps","Speakers":"Speakers: Frederik Winstrup Johansen","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"App3002","Location":"Sal 8","Description":"MVVM er et udbredt pattern brugt til udvikling af applikation baseret på XAML-teknologien som f.eks WPF, Silverlight, Windows Phone og Windows 8 app's. Med indførelsen af Universal App's er det nu blevet endnu nemmere at lave app's til både Windows Phone og Windows, men hvad med MVVM-frameworks? Kan de stadig anvendes til Universal Apps? Jeg vil anvende Caliburn Micro-frameworket i et Universal App-projekt, og vise hvor nemt det er at bygge en kodebase som kan anvendes på to forskellige device platforme. Struktur og opbygning af et MVVM-projekt i VS vil blive gennemgået samt gennemgang af en masse C#- og XAML-kode. Ved at deltage i denne session vil jeg vise hvordan man anvender et MVVM framework i et Universal App projekt i Visual Studio 2013. Struktur og guidelines vil blive gennemgået med en række best practice for anvendelse.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Deep-Dive-MVVM-og-Universal-Apps","Track":"App Development","TrackCode":"app"},{"Title":"7 gode grunde til at du bør bygge dine egne xaml kontroller","Speakers":"Speakers: Daniel Vistisen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"App30010","Location":"Sal 8","Description":"Udvikling af egne kontroller behøver slet ikke være kompliceret. I denne session tager vi et kig på hvorfor det at bygge egne kontroller på xaml platformen er en af de mest fleksible og effektive manøvre alle burde mestre. Kom og få al den viden du skal bruge for at komme igang!I løbet af denne session bliver der brugt eksempler fra den virkelige verden og emnerne vi kommer igennem er blandt andet: Dependency properties, Styles, Templates, Measure & Arrangement, Items og ItemContainers.På denne sesion lærer du at udvikle egne kontroller og avanceret XAML udvikling.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App30010","Track":"App Development","TrackCode":"app"},{"Title":"Tre varianter af Microsoft Azure Management Libraries","Speakers":"Speakers: Morten Christensen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"Web30010","Location":"Sal 3","Description":"Udover Microsoft's Azure Portal har du Azure xPlat CLI, Azure Powershell cmdlets og senest et nyt Azure management library i C#, som du kan bruge i dit arbejde med Azure. Hver af disse tre libraries giver dig mulighed for, blandt mange andre ting, at scripte eller kode oprettelse og fjernelse af langt størstedelen af tilgængelige Microsoft Azure services. Men hvorfor vælge at bruge et frem for et andet, og giver det mening at bruge dem i kombination med hinanden?I denne session vil vi kigge på xPlat CLI, Powershell cmdlets og management library'et i C# for at komme nærmere et svar på hvornår det giver mening at bruge en variant frem for en anden, samt hvornår det kan være relevant at bruge en kombination. Vi kigger nærmere på hvordan kombinationen af Azure's Powershell cmdlets og den nye Automation service kan bruges til at holde sine virtuelle maskiner opdateret.Afslutningsvis vil jeg vise hvordan management library'et i C# kan bruges til at oprette nye Microsoft Azure Sql Databaser og -Servere i et scenarie hvor der løbende opstår behov for nye.Ved at deltage I denne session vil du få en dybere indsigt I Azure's management libraries, samt hvornår og hvordan de kan anvendes. Det kan f.eks være i samarbejde med Azure's Automation Service, dev/test scenarier eller til brug i SaaS øjemed.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web30010","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Integrerede systemer i skyen","Speakers":"Speakers: Morten la Cour","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"Web30011","Location":"Sal 3","Description":"Vi lever i en integreret verden med systemer, der kommer fra alle verdenshjørner. Udfordringen i 2014 er at binde systemerne sammen på en intelligent måde, der bidrager med værdi til brugeren og ikke er et mareridt for udvikleren eller systemadministratoren. I denne session vil Morten La Cour Thomsen bygge et integreret system, der præsenteres som et AngularJS-website med elementer fra en lokal SQL Server, BizTalk Server 2013 R2, EDIFACT via FTP og BizTalk Services samt Azure Service Bus til at binde det hele sammen.Sessionen vil i høj grad være relevant for web-udvikleren, der arbejder i en enterprise-verden med en blanding af mange forskellige systemer fra forskellige leverandører. I sessionen vil det blive vist (i dybden!), hvordan man kan udvikle en web-baseret løsning med AngularJS, der sender data til de tunge systemer i backenden, på en smart og fremtidssikret måde.Man vil som deltager lære om de services, der er tilgængelige i skyen for at binde lokale, forretningskritiske systemer sammen med en web-frontend. Man vil få en dyb indsigt i Azure Service Bus, BizTalk Server samt EDIFACT via FTP og Azure BizTalk Services","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web30011","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Introduktion til Internet of Things og Microsofts IoT strategi","Speakers":"Speakers: Rene Løhde , Ulrik Bærholm","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"App3003","Location":"Sal 8","Description":"Ifølge Gartner topper Internet of Things (IoT) hype-kurven lige nu. Hvis du har undret dig over hvad Microsofts historie på IoT er, og hvordan dette vil afspejle sig hos udvikleren, er dette sessionen for dig. Sessionen vil være en generel introduktion af IoT, Microsoft IoT strategi og hvordan denne manifesteres i software og værktøjer. Det vil være en tour-de-force af dataproducenterne, som sensorer og \"gateways\", data opsamling og transformation baseret på komplekse event-processing.Efter denne session vil deltagerne vide hvad internet of Things er, hvilken udlægning Microsoft har af IoT og hvilke produkter og værktøjer udvikleren kan gøre brug af.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App1003","Track":"App Development","TrackCode":"app"},{"Title":"Fritekst-søgning med Azure Search","Speakers":"Speakers: Anders Lybecker","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"App3009","Location":"Sal 8","Description":"Brugernes forventninger til søgning er skyhøje – hvis ikke din applikation levere relevante resultater på få millisekunder, så er de videre eller mentalt erklæret dit system ubrugeligt. Azure Search er en search-as-a-service løsning der gør det nemt at levere en god søgeoplevelse uden at være søgeekspert.De facto standarden for applikationssøgning er Lucene, som oftest bruges med applikationsserverne Solr eller ElasticSearch. Disse kører på en Java applikationsserver, som også kræver vedligeholdelse og ekspertise. Administration, backup mv. håndteres for dig med Azure Search – uden du mister kontrol, da Azure Search er baseret på ElasticSearch.Deltagerne vil lære at integrere deres eksisterende løsning med Azure Search.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App3009","Track":"App Development","TrackCode":"app"},{"Title":"Designing beautiful apps with lessons learned from apps all around the world","Speakers":"Speakers: Deani Hansen","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"App2007","Location":"Sal 8","Description":"Design and dev lead Deani Hansen helps everything from hobby developers to large enterprises around the World designing and building their flagship apps for Windows and Windows Phone ecosystem. This session will bundle up some of the most common made mistakes as well as demonstrate how you, with a few easy-to-learn tips and tricks, can create a more branded and beautiful experience. Join this session to learn how you can leverage your UI and UX to the next level. Advance your XAML skillsDesign beautiful appsWin user minds with great UX","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App2007","Track":"App Development","TrackCode":"app"},{"Title":"Restricted Admin & Credential Exposure","Speakers":"Speakers: Hasain Alshakarti","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"Data3005","Location":"Sal 2","Description":"Domain administrators, highly privileged service accounts and server administrator credentials are often spread across the IT-infrastructure. Attacks like passing the hash, passing the token and other well-known methods used by cyber criminals can utilize exposed credentials to expand influence and obtain control over the entire Active Directory Domain. We will show you how you can protect your administrative privileges using techniques like Authentication Mechanism Assurance, Network UAC Filtering, Virtual Smart Cards, Managed Service Accounts, JEA and more.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3005","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"I skyen med Microsoft Azure – Hvad er nyt og lækkert?","Speakers":"Speakers: Rasmus Jaque","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"Data3006","Location":"Sal 1","Description":"Du er sikret en masse super seje Azure demoer i denne session!Sidste år gik vi live med \"Azure Infrastructure as a Service\" (IaaS). Siden dengang, har vi kontinuerligt udviklet eksisterende features og tilføjet en hel masse nyt til IaaS platformen. I denne session, vil vi fokusere på nogle af de nye super seje features og funktionaliteter der senest er blevet tilføjet IaaS platformen.Få en grundig teknisk introduktion til hvad der er nyt i Azure","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data3006","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Hyper-V - Whats New","Speakers":"Speakers: Anders Ravnholt","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"Data30018","Location":"Sal 2","Description":"Hyper-v har gennemgået en rivende udvikling gennem de seneste år. Den næste version er ingen undtagelse. Kom og hør om de nye features i Windows Server som støtter op omkring virtualisering på Windows. Vi vil vise demoer samt gennemgå områder som VMs, Netværk og Storage.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30018","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Windows Azure Pack","Speakers":"Speakers: Anders Ravnholt","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"Data30019","Location":"Sal 1","Description":"Windows Azure Pack gør virksomheder i stand til at tilbyde Microsoft Azure services i deres eget datacenter. Denne løsning er en af de vigtigste funktioner for at tilbyde Cloud OS fra Microsoft, løsningen gør det nemt at tilbyde Self-service, Automation og ensarte datacenteret. Kom og hør om de muligheder Windows Azure Pack kan tilbyde som en del af jeres cloud strategi. Vi vil gennemgå områder som PaaS, IaaS, forbrug samt administration af kunder. Der vil være demoer.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30019","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Protecting your Private Cloud/data","Speakers":"Speakers: Jens Ole Kragh","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"Data30021","Location":"Sal 2","Description":"I denne session ser vi på nogle af de teknologier fra Microsoft, der kan hjælpe dig med at sikre adgangen til firmaets servere/data, herunder Active Directory. Sessionen vil være krydret med demo'er, Best Practice og \"Notes from the field\", hvor vi bl.a. skal høre om, hvordan en professionel hacker fik adgang til en kundes datacenter. Få dybere kendskab til nogle af de indbyggede sikkerheds features i Windows Server 2012 R2 og hvorfor de er så vigtige at bruge","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data30021","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Real World management of Windows 8.1 and mobile devices with Windows Intune & System Center 2012 R2 Configuration Manager","Speakers":"Speakers: Kent Agerlund, Hasain Alshakarti","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"Win4005","Location":"Sal 5","Description":"In this session we will focus on real world challenges and solutions you will run into when managing mobile devices and Windows 8.1 devices in the organization using Windows Intune and Configuration Manager. Learn how Kent Agerlund (ConfigMgr expert) and Hasain Alshakarti (PKI expert) implemented complete MDM solutions with support for application deployment, wireless profile management, certificate deployment with support for Windows 8.1 devices, Windows Phone, iOS devices and Android devices. Expect a session packaged with real life examples where you will learn the entire process from building the infrastructure to sideloading applications. Keywords are Intune integration, building the PKI requirements ADFS and NDES, certificate and application deployments.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win4005","Track":"Windows Client","TrackCode":"win"},{"Title":"Architecture for Mobility with EMS","Speakers":"Speakers: Simon May","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"Win3007","Location":"Sal 5","Description":"Get an insight into why and how to build a mobility platform that leads to less user friction, simpler IT administration and reduces cost. In this session we'll look at what needs to be built both on-premises and in the cloud to deliver a hybrid enterprise mobility solution, we will look at architecture for Hybrid Identity that creates single sign on to 2500+ SaaS apps and opens up big-data, machine learning based reports given your \"big data for the IT admin\". How to build a scalable hybrid MDM solution that leverages corporate identity and how to further leverage that identity to deliver hybrid access and protection solutions that protect files wherever they go.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win3007","Track":"Windows Client","TrackCode":"win"},{"Title":"Business Access on Consumer Devices: The Consumerization of IT for Users at Microsoft","Speakers":"Speakers: Mark Lawrence","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"Win3009","Location":"Sal 5","Description":"Users expect IT to support device choice – to enable safe business experiences on consumer devices like personal Smart Phones, Tablets, and Laptops. This is true at Microsoft where users have both Windows devices and non-Windows devices and need access to Line Of Business apps in the data center and in the Cloud, and need global access to Corporate Networks.Microsoft IT has embraced the Consumerization of IT, creating trust through provisioning of required configuration, protecting business data, providing business apps across platforms and enabling access to business networks.Attend this session to understand how Microsoft IT has enabled device choice for business users using Microsoft (hybrid) Unified Device Management and Online service solutions, including Windows Intune and Office 365.Describe and Demonstrate how Microsoft IT has embraced the Consumerization of IT by enabling safe business access using Mobile Device Management","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win3009","Track":"Windows Client","TrackCode":"win"},{"Title":"Nyheder i Microsoft Dynamics CRM 2015","Speakers":"Speakers: Henrik Jensen","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"CRM2003","Location":"Sal 13","Description":"På denne session vil deltagerne blive præsenteret for en række af nyhederne i den kommende version af Microsoft Dynamics CRM, nemlig Microsoft Dynamics CRM 2015. Der er ikke bare tale om nogle små nyheder og forbedringer hist og her, men nyheder som ændrer den måde man bruger systemet på. Nogle af de nyheder som vil blive gennemgået er:• De nye muligheder for visualisering af data (f.eks. hierarkier)• Forbedringer omkring guidede salgsprocesser• Endnu flere nyheder med Forretningsregler (Business Rules)• Nyheder som vedrører produkter• Næste skridt med Microsoft Dynamics CRMMålet med denne session er at give deltagerne et indblik i en række af de mange spændende nyheder som Microsoft frigiver sammen med Microsoft Dynamics CRM 2015","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM2003","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Service Management med Dynamics CRM 2013 og System Center 2012 R2","Speakers":"Speakers: Mads Møgelvang Nielsen, Kristoffer Vad","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"CRM2004","Location":"Sal 13","Description":"Dynamics CRM 2013 og System Center 2012 er begge stærke værktøjer, indenfor hver deres områder. Kom og se hvorledes man kan udnytte CRM's styrker inden for håndtering af de \"bløde\" medarbejder/kundeforespørgelser i kombination med System Center's styrker omkring overvågning af infrastruktur.Sessionen vil undervejs beskrive en række scenarier, samt den bagvedliggende tekniske arkitektur.Denne session vil demonstrere værdien af Dynamics CRM 2013 i kombination med System Center 2012.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM2004","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Part I : And end-to-end Big Data solution using HDInsight anf Hive AND Predicting delay using HDInsight and Azure Machine learning","Speakers":"Speakers: Kenneth M. Nielsen, Régis Baccaro","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"SQL3006","Location":"Sal 10","Description":"This is the first part of a 2 part session. The second part will show how to use the data for predicting airline delay. By now you've probably heard about Big Data 1.000 times or more so why a new session about big data you might ask.Well first of all because this sessions presents an end-to-end Big Data solution which a lot of people are asking for, to see how it fits in their existing BI / DataWarehouse environment and investment. Secondly because we need to We are going to use a couple of years of airline on-time performance data which is published by the Bureau of Transportations Statistics. This session will show you how :Downloads and prepares several years of demo data and storing it in a dedicated Azure Blob Storage account.Create a storage account and container for the HDInsight Cluster.Create a SQL database server instance and a SQL database for the Hive Metastore. We will also setup the necessary firewall rules so that you can access the server directly.The HDInsight cluster is provisioned and configured for access to the sample data.A partitioned Hive table is created over top of the sample dataExploration of the result Attend this session to Learn how to use HDInsight, use Azure Storage, Create Database, and finally explore the data and result – After this session, you will be able to use the powerfull server setup that Azure is, we'll show you how easy it is to create new servers and storage for later use.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/An-end-to-end-Big-Data-solution-using-HDInsight-and-Hive-AND-Predicting-airline-delay-using-HDInsigh","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Part 2:  Predicting airline delay using and end-to-end Big Data solution using HDInsight anf Hive AND Predicting delay using HDInsight and Azure Machine learning Part two","Speakers":"Speakers: Kenneth M. Nielsen, Régis Baccaro","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"SQL3007","Location":"Sal 10","Description":"This is the second part of a 2 part session. In the first part we saw how to collect and model data using HDInsight and Hive.Machine learning as a service isn't new, but when Microsoft offers it as part of Azure you have to take notice. It is also worth noting that Microsoft already has a cloud based service for big data based on Hadoop - Azure HDInsight. One of the Microsoft Azure HDinsight key components is Mahout, a scalable machine learning library that provides a number of algorithms relying on the Hadoop platform but now there is a new kid in Machine Learning town: Azure Machine Learning that also can use HDInsight as a datasource. Let's find out if Azure ML is targeted at users not willing or able to learn the technicalities of implementing a Hadoop solution. In this session we will use the CRISP data mining methodology to build an ML solution from end to end using HDInsight as a data source. We will look at ML studio, the algorithms, the types of learning, Hadoop map/reduce of our datasets, ML support for R, the ML API Service, how to interpret the results and finally how to deploy it to a large scale production-like environment using SSIS and C# to build customer recommendations. We will use the data generated in the Part I of the presentation to predict if your upcoming flight is going to be delayed or not. If time allows we will also check the predictions against the actual facts to see the accuracy of the implemented algorithms. Attend this session to learn to use Azure Machine Learning, the concepts, ML studio and to use it in a production like environment","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/SQL3007","Track":"SQL Server & Business Intelligence","TrackCode":"sql"},{"Title":"Visual Studio 14 CTP | Tips & Tricks","Speakers":"Speakers: Christian Helle","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"VS3006","Location":"Sal 7","Description":"A fast paced walkthrough of how to get the most out of Visual Studio and what's new in the upcoming Visual Studio 2014. This presentation will mainly be focused on the C# language using the Visual C# keyboard mapping.Show some old but useful gems in Visual Studio as well as new stuff in Visual Studio 2014, which might be useful for developers.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3006","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"CrossPlatform Development","Speakers":"Speakers: Christian Helle","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"VS3007","Location":"Sal 7","Description":"Take advantage of existing .NET and C# knowledge to build apps for Android and iOS apps using Xamarin and Visual Studio. In this talk we will cover the tools you need to get started, learn how stuff works, learn how to share code and resources across the platforms, learn how to use Portable Class Libraries with Xamarin, the new Xamarin Forms, and how to share the same UI code for iOS, Android, and Windows platforms.Show how it is possible to use C#/.NET and one code base for developing for more mobile platforms.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3007","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"C# & Roslyn","Speakers":"Speakers: Ole Hedegaard","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"VS3008","Location":"Sal 7","Description":"C# har udviklet sig lidt I bølger siden den første release. I den seneste version er der både nye spændende sprogfeatures, som er implementeret udelukkende i kompileren og som dermed ikke kræver opdateret .NET framework. Yderligere kigger vi på den spændende Roslyn teknologi og hvordan den passer ind i det samlede billede.Give et overblik over nye features og konstruktioner i C# sproget samt en introduktion til Roslyn.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS3008","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Sikr din løsning til fremtiden datamængder med \"Elastic Scale\"","Speakers":"Speakers: Lasse Skytte Knudsen","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"Web3007","Location":"Sal 3","Description":"Hvordan kan vi bygge en multi-tenant løsning, hvor vi ikke er bange for vækst i datamængder eller antal brugere?Hvordan sikrer vi at f.eks. nye fakturaer automatisk bliver gemt på vores nye SQL server, mens gamle fakturaer automatisk \"flytter\" over på den gamle SQL server...?Hvordan kan vores løsning transparent dele data imellem on-premise SQL server og Azure SQL servere?Dette vil du få svar på ved at se demo af den nye \"Elastic Scale\".Har du tidligere anvendt SQL Federation til at løse nogle af ovenstående elementer, så kommer du ikke udenom at skulle tage stilling til hvordan du migrerer din nuværende løsning i løbet af 2015. Vi deler ud af vores erfaringer på området.Denne session vil give kendskab til \"Elastic Scale\" og hvordan jeg kan anvende det i praksis.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Sikr-din-l-sning-til-fremtiden-med-Data-Elasticity-Framework","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Exchange 2013 upgrade and coexistence","Speakers":"Speakers: Jakob Østergaard Nielsen, Peter Schmidt","DateTime":"November 25, 2014 from 11:00AM to 12:15PM","SessionCode":"UC3001","Location":"Sal 6","Description":"Kom og hør om opgradering til Exchange 2013 og best practice samt koeksistens med eksisterende Exchange miljø.Vi kigger desuden på de nye muligheder med Exchange 2013 SP1 og Public Folder Mailboxes.Der gennemgås processen for flytning til den nye Exchange platform og hvordan Outlook kommunikere med Exchange 2013.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/UC3001","Track":"Microsoft Unified Communications","TrackCode":"uc"},{"Title":"Udvid din test portefølje med Coded UI tests og cloud baseret load test.","Speakers":"Speakers: Peter Lindberg","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"VS20011","Location":"Sal 7","Description":"Når man som udvikler beskæftiger sig med test, er det ofte med et fokus på unit tests. I denne session vil vi gå i dybden med nogle af de andre områder inden for test på Visual Studio platformen, man som udvikler kan drage fordel af.Vi tager et kig på at automatisere tests med Coded UI tests, og blandt andet udnytte de tests som testerne allerede har lavet og optaget i Microsoft Test Manager, og sætte strøm til dem så de f.eks. kan afvikles automatisk i dine builds.Vi kigger også nærmere på Load Test, der med introduktionen af Visual Studio Online er blevet lidt mere tilgængeligt, med test tid tilgængelig som en del af dit MSDN abonnement, som man kan benytte sig af til at få trykprøvet sine applikationer uden at skulle bekymre sig om infrastruktur.Få et overblik over de testmuligheder du som udvikler har med Visual Studio-platformen ud over det normale førstevalg unit tests","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS20011","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Office 365 – Power BI integration med CRM og AX","Speakers":"Speakers: Henrik Bo Christoffersen","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"CRM20010","Location":"Sal 13","Description":"De fleste der arbejder med CRM og AX2012 kender alt til de udfordringer der er med at skabe rapportering på tværs af ERP og CRM.Office 365 og Power pivot er stærk værktøjskasse til løse opgaven, og vi gennemgår nogle forskellige eksempler på rapportering på tværs af Microsoft CRM og Microsoft Dynamics AX ERP data.Vi gennemgår teknisk opsætning og forudsætninger, samt viser eksempler på, hvordan man henter data i Microsoft Dynamics AX og CRM online.På denne session vil du se hvor hurtigt og effektivt Power Pivot er til at skabe analyser på tværs af Microsoft platformene for CRM og AX.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM20010","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Collaborating with Yammer and Office 365 including Yammer User Management","Speakers":"Speakers: Simon Tange, Henrik Mønsted","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"Prod2001","Location":"Sal 4","Description":"Introduction and demonstration of Yammer showing how it is used in organizations to meet the growing need to share information and work like a network. This includes a presentation of Delve, the integration into SharePoint Online and OneDrive For Business with document conversations. And we will walk through the process of enabling Single Sign On, Directory Sync to Yammer or enable user mapping to save your Office 365 users time signing in to Yammer.Learn how to start up a Yammer project in your organization.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod2001","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"OneDrive for Business","Speakers":"Speakers: Dan Strang Søndergaard","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"Prod2002","Location":"Sal 4","Description":"OneDrive for Business er Microsofts sikre alternativ til Dropbox og lignende filsynkroniseringstjenester. OneDrive for Business giver hver bruger 1 TB, samtidig med at IT har den kontrol og sikkerhed som en virksomhed kræver.I denne session gennemgås servicen. Vi kigger på hvordan den sættes op og overvåges. Desuden vil vi også kigge ud i fremtiden og løfte sløret for kommende features for OneDrive for Business.Ved at deltage i denne session vil du være I stand til at1. Forstå hvad OneDrive for Business er og hvilke problemer den løser2. Have en god forståelse af hvordan jeg kommer i gang, konfigurerer og overvåger løsningen.3. Have indsigt i roadmap og kommende investeringer for OneDrive for Business.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Prod2002","Track":"Produktivitet & Samarbejde","TrackCode":"prod"},{"Title":"Operational Intelligence with System Center Advisor and System Center Operations Manager","Speakers":"Speakers: Lorenzo Rizzi","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"Data20022","Location":"Sal 2","Description":"This session covers how Operations Manager as a platform has been extended with System Center Advisor to provide Operational Intelligence about customers' environments by capturing their operational/machine data into a big data store in Microsoft Azure. Come to this session and see how easy it is to collect data logs and explore them. By attending this session, I will learn how System Center Advisor extends the capabilities of Operations Manager for efficient troubleshooting and forensic analysis by leveraging high performance Azure storage and services","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data20022","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Social segmentering – hvorfor kun lytte på sociale medier?","Speakers":"Speakers: Bernt Bisgaard Caspersen","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"CRM2001","Location":"Sal 13","Description":"Hvordan kan virksomheder eller organisationer udnytte signaler fra de sociale medier til at blive mere målrettede overfor eksisterende kunder og til at identificere nye? Microsoft Social Listening kan understøtte f.eks. Brand Management og Product Management med sine analytiske og statistiske funktioner. I denne session viser vi hvordan du kan gå et skridt videre og 1) track'e social adfærd helt ned til den enkelte person, og 2) automatisere segmentering og oprettelse af leads/cases til understøttelse af effektive markedsførings- og CRM-processer. Eksempler på dette kan være markedsføring, op- og krydssalg eller udvalgte funktioner i kundeservice. Vi viser en unik løsning \"Automatiseret Social Profiling\" bygget på Microsoft Social Listening, Windows Azure, og Microsoft Dynamics CRM. Eksempler på anvendelse kunne være:Detailkæder der vil sende tilbud ud, baseret på positive posts omkring produkterTeleselskaber der vil stoppe kundeflugt med et \"bedre tilbud\" til kunder der udtrykker en negativ holdning til deres brand eller et produktForsikringsselskaber der ønsker øgede krydssalgsmuligheder ved at kunne segmentere på kunders posts om deres bil, bolig, børn, rejsevanerSportsklubber der vil identificere nye fans og adressere eksisterende fans ud fra disses hyppige og positive posts om fx deres favoritspiller.Denne session giver deltagerne mulighed for at:kunne identificere muligheder for at gå fra analyse til engagement på sociale medierforstå og positionere produkter og løsninger fra Microsoft på dette feltskabe værdi for min virksomhed eller mine kunder ved at diskutere perspektiver, muligheder og løsninger inden for dette felt","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM2001","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Nye Application Lifecycle Management (ALM) tools i CRM 2013 SDK'et","Speakers":"Speakers: Kasper Birch Olsen","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"CRM3002","Location":"Sal 13","Description":"Med den seneste opdatering af CRM har vi fået et antal nye værktøjer, der kan forbedre udviklings- og udrulningsprocesser betydeligt.I denne session kigger vi nærmere på disse og hvordan de kan tages i brug i eksisterende processer.Formålet med sessionen er at introducere de nye Microsoft CRM ALM tools .","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM3002","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"All-round strongly-typed approach to MS CRM","Speakers":"Speakers: Ramon Soto Mathiesen","DateTime":"November 26, 2014 from 3:00PM to 4:15PM","SessionCode":"CRM3005","Location":"Sal 13","Description":"Normally you would always use strongly typed code to create business critical applications, as the approach will ensure that errors in code will be spotted at compile time, and hereby providing a better user experience. When working with the MS CRM platform, it is possible to use strongly-typed code, early-bound generated with CrmSvcUtil.exe. The main problem is that this is only possible when working with server side code, so you might have robust server side code but a fragile client side. In order to ensure a more robust client side code, we have created our own version of CrmSvcUtil that generates TypeScript declaration files to be used with the Xrm SDK JavaScript libraries. Additionally, we have expanded our current DAXIF# with a TypeProvider module that ensures that our MS CRM scripting files (Click-Once Deployment, Data migration ...) are type checked for correctness, before executing. The correctness check is also applied on data (Eg.: let filter = frm.Records.UserQuery.DeltaActiveAccounts, were we ensure that the view we point at, it actually exists in the source/target system)Our goal is to inspire customers and other consultancy houses to use Microsoft's newest technologies, TypeScript and the functional programming language F#, in combination with the MS CRM platform in order to create more correct and robust applications as well as deliver them faster with fewer errors.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM3005","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Microsoft Dynamics CRM – Integrationer gjort enkle","Speakers":"Speakers: Jakob Bech Benediktson, Jeppe Bech Madsen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"CRM2006","Location":"Sal 13","Description":"Microsoft Dynamics CRM er kernen for viden i virksomheden. Alle potentielle kunder og nuværende kunder er tilgængelige med salgsrelevant viden. Men hvad med viden fra interne systemer såsom økonomi- og supportsystemer. Og hvad med alt den eksterne viden fra Bisnode/ Experian og LinkedIn. Hvad med ruteplaner til kunden?Lasso præsenterer en helt ny og enkel vej til at samle denne viden op, linke den og præsentere den for brugeren i Microsoft Dynamics CRM – fra alle kilderne på én gang. I stedet for tidligere tiders store integrationsprojekter kan man nu nemt linke præcis de data, som er relevante for den enkelte medarbejder og endda foretage målgruppesøgninger til kampagner og marketing.På sessionen gennemgår vi praktiske eksempler på:- Hvordan integrationen mellem Dynamics CRM og et økonomisystem fungerer og eksempler på relevante data- Hvordan du kan bruge Linkedin direkte fra Dynamics CRM- Opslag fra Dynamics CRM på ekstern markedsdata, regnskaber og kreditvurderingsinformation- Inspiration til alle de muligheder, som nu åbner sig for brugerenEfter denne session du have fået inspireret til hvordan du fremover kan udnytte alt den viden omkring dine kunder, som du har i virksomheden og kan finde hos eksterne kilder.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM2006","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Integrating SharePoint with Microsoft Dynamics CRM","Speakers":"Speakers: Dennis Hobmaier","DateTime":"November 26, 2014 from 10:45AM to 12:00PM","SessionCode":"CRM3007","Location":"Sal 13","Description":"This session will show you how you can be more productive with Microsoft Dynamics CRM. You will learn:How to integrate Dynamics CRM and SharePoint. This can be used to manage documents related to a Dynamics CRM recordHow dedicated SharePoint users can collaborate with pure Dynamics CRM usersExtend Dynamics CRM Search capabilitiesIntegrate your phone using TAPI – tracking calls in CRM is just one click awayRecord based Backup and RecoveryWindows 8.1 Apps to support you at your fingertipsLearn how you can positively transform facilitate business success and accelerate customer engagement with Microsoft Office 365 and Dynamics CRM Online.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM3007","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Microsoft Dynamics Marketing – Manage your marketing data and processes programmatically through MDM SDK","Speakers":"Speakers: Tomas Burger, Ken Christensen","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"CRM3008","Location":"Sal 13","Description":"Microsoft Dynamics Marketing (MDM) is the cloud-based product, to manage all your marketing activities, from marketing asset nurturing, through event and campaign management, to full automation of your marketing processes.Software Development Kit for MDM (SDK), released first with spring 2014 release (16.0), allows customer to integrate their MDM software as a service with third party solution, or their proprietary systems.Session will focus on real coding exercises, showing many possible techniques, customers can use to integrate with MDM.By attending this session I will understand various options how to integrate third party systems with Microsoft Dynamics Marketing and I will be able to use MDM SDK and develop integration solution on my own.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM3008","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Customer Care","Speakers":"Speakers: Jan Heimann, Bjørn Jeppesen","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"CRM2009","Location":"Sal 13","Description":"En introduktion til Microsoft Dynamics CRM Service Management, samt en gennemgang af funktionalitet i Dynamics CRM 2015, herunder Intelligent routing af kald og emails.Styring af Service Level Agreements og Entitlements samt Selvbetjenings Portal (Parature) og Knowlegde Management.Vi gennemgår også hvordan du kan konfigurere Unified Service Desk så den passer til netop din service organisation.At give tilhørende indsigt i service virksomhedernes krav til systemunderstøttelse af en service organisation.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM2009","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Microsoft Dynamics Marketing – an Introduction","Speakers":"Speakers: Mauro Marinilli","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"CRM10011","Location":"Sal 13","Description":"Curious to know what Dynamics Marketing does, which scenarios addresses and its intended users? Then join us to learn about Dynamics Marketing functionality, main scenarios and user roles in detail.Learn about Microsoft Dynamics Marketing functional areas and capabilities.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/CRM10011","Track":"Microsoft Dynamics CRM","TrackCode":"crm"},{"Title":"Workflows inkl. Integration til Apps og email","Speakers":"Speakers: Niels Kodal, Jonas Asker Boye","DateTime":"November 27, 2014 from 10:45AM to 12:00PM","SessionCode":"AX3002","Location":"Sal 10","Description":"På sessionen vil bl.a. følgende blive gennemgået: - Opsætning og konfiguration af Workflows i AX2012. - Opsætning af Windows Azure- Erfaringer fra praktisk brug af Workflows, inkl. eksempler på godkendelse af kreditor faktura og rejseafregning. - Brug af worklows på Enterprise portal- Brug af Apps på forskellige platforme, herunder Windows 8, Android og iOS. - Tilpasninger til Workflow funktionaliteten i AX2012. Formålet med denne session er at demonstrere hvordan Workflow i AX2012 kan benyttes til at optimere arbejdsgange i virksomheden, samt vise hvor nemt det er at opsætte integration til Dynamic Companion Apps og e-mails ved brug af Windows Azure.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/AX300_2","Track":"Microsoft Dynamics AX","TrackCode":"ax"},{"Title":"Interaktionen mellem AX2012 og resten af Microsoft stacken","Speakers":"Speakers: Niels Kodal, Kenneth Minck","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"AX2003","Location":"Sal 10","Description":"På sessionen vil bl.a. følgende blive gennemgået: - Integration mellem AX og MS Project.- Brug af SharePoint til projekt- og dokumentstyring. - Oprettelse af dynamiske dokumenter i Word. - Dynamisk rapportering ved brug af Excel og Power View / Power Pivot. Formålet med denne session er at demonstrere hvor nemt AX2012 kan integrere op i mod standard Microsoft produkter, såsom Excel, Word, MS Project, SharePoint, Outlook osv. På sessionen vil der være en gennemgående case hvor der vises eksempler på praktisk brug af de forskellige værktøjer.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/AX2003","Track":"Microsoft Dynamics AX","TrackCode":"ax"},{"Title":"Application Lifecycle Management i relation til AX2012 R3","Speakers":"Speakers: Jesper dybdahl","DateTime":"November 27, 2014 from 1:00PM to 2:15PM","SessionCode":"AX3001","Location":"Sal 10","Description":"På denne session vil vi:1) Vise et overblik over topologien2) Vise hvorledes TFS bruges til projektstyringa. Via webb. Via Team Explorerc. Exceld. MS Project3) Vise hvordan koden flyttesa. Check in, Sync4) Igangsætte et buildFormålet med denne session er at vise Application Lifecycle Management i relation til AX og vise hvor meget lettere det hele er med Azure, Lifecycle services og Visual Studio Online.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/AX3001","Track":"Microsoft Dynamics AX","TrackCode":"ax"},{"Title":"Single-Page Application Patterns for the .NET Developer","Speakers":"Speakers: Christian holm Diget","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"Web2002","Location":"Sal 3","Description":"Single Page Application-frameworks har på det seneste vundet ekstremt megen popularitet, og som et resultat heraf er AngularJS nu blevet en af projektskabelonerne I ASP.NET. Angular- applikationer består af en række patterns, som du måske allerede kender fra .NET-verdenen. Det vil vi bygge videre på i denne session, og vi vil arbejde med hvordan man kan bruge AngularJS enten til at udbygge din nuværende client-side-arkitektur eller til at bygge den helt fra bunden! I denne session vil man lære om de mest populære frameworks, der er inden for client-side- webudvikling anno 2014. Man vil lære om fordelene og ulemperne ved frameworks'ne og få tips og tricks til, hvordan man designe den bedste client-side-løsning ud fra de behov, man har i sin forretning.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Web2002","Track":"Microsoft Azure og Webudvikling","TrackCode":"web"},{"Title":"Tablet app for Dynamics C5 2015 & NAV 2015","Speakers":"Speakers: Mike Borg Cardona","DateTime":"November 25, 2014 from 3:15PM to 4:30PM","SessionCode":"NAV2003","Location":"Sal 9","Description":"Dynamics NAV is going totally apps. Bring your own tablet device - e.g. a Surface - and your favorite Dynamics business solution will follow you on the trip. Easy to use, fully touch-enabled and flexible to customize. We'll show you the rich capabilities in Dynamics NAV for Tablets and how to get started with customizing the app.Get an overview of new tablet app for Dynamics NAV incl. how to configure, use and enhance.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/NAV3003","Track":"Microsoft Dynamics C5 & NAV","TrackCode":"nav"},{"Title":"Udnyt SharePoints muligheder med Provider-Hosted Apps i Azure Websites","Speakers":"Speakers: Børge holse","DateTime":"November 27, 2014 from 9:00AM to 10:15AM","SessionCode":"App2001","Location":"Sal 8","Description":"Mulighederne er mangfoldige med SharePoint Online's App Model, og du er som udvikler i førersædet, når det kommer til at udvide funktionaliteten i SharePoint! Kom og lær om hvordan du kan bruge Azure Web Sites til at hoste MVC- og WebForms-baserede sites som Provider-Hosted Apps i skyen. Vi vil også komme ind på brugen af Web Jobs til at automatisere workflows i baggrunden. Få et indblik i hvordan man kan udvide funktionaliteter på SharePoint ved at flytte ud i Azure!","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/App2001","Track":"App Development","TrackCode":"app"},{"Title":"AX 2012 R3 Warehouse Mobile Devices. Funktionalitet, konfiguration og tilpasning","Speakers":"Speakers: Niels Kodal, Kenneth Minck","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"AX3004","Location":"Sal 10","Description":"På sessionen vil bl.a. følgende blive gennemgået: - Opsætning og installation af den mobile klient - Opsætning af primære arbejdsprocesser i WMS AX2012. - Locations directives - Work templates - Wave templates - Klient form setup- Reservations principper- Load/Shipment building - Demo af process flow-Tilpasning af Klient - Tilpasning af Klient forms (Felter, variabler og metoder) - Integration metoderFormålet med denne session er at demonstrere hvordan det nye WMS system fungere i AX2012 og hvordan det kan benyttes til, at optimere arbejdsgange i virksomheden, samt hvor evt. tilpasninger til den mobile enhed udføres","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/AX3004","Track":"Microsoft Dynamics AX","TrackCode":"ax"},{"Title":"Introduktion til den nye Windows Server & System Center","Speakers":"Speakers: Rasmus Hald, Anders Ravnholt","DateTime":"November 26, 2014 from 9:00AM to 10:15AM","SessionCode":"Data300","Location":"Sal 1","Description":"Kom og hør hvordan den kommende version Windows Server & System Center kan hjælpe din virksomhed. I denne session vil vi gennemgå nyhederne i Windows Server & System Center Preview og give dig et unikt teknisk indblik i hvordan det vil gøre en forskel. Vi gennemgår de mange nye funktioner og giver dig praktiske demonstrationer på anvendelse - En must-see session for dig der arbejder med Windows Server & System Center","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data300","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Gennemgang af udvalgte Windows Server Preview sikkerheds features samt næste generation af Web Application Proxy","Speakers":"Speakers: Claus Jespersen","DateTime":"November 26, 2014 from 1:00PM to 2:15PM","SessionCode":"Data3001","Location":"Sal 1","Description":"Windows 8.1 og Windows Phone 8.1 tilbyder et vælg af nye sikkerheds features og med Windows Preview er overliggeren hævet endnu mere. Sikkerhed er således virkelig i fokus i næste version. Udnyt muligheden og kom og høre om mange af de nye sikkerheds foranstaltninger, der er indbygget i næste version Windows Server hvor fokus vil være på features i denne , herunder også gennemgang af nye features i Web Application Proxy som en del af Windows Server Preview Ved at deltage i sessionen får du et bedre indblik i, hvorfor det er at Microsoft nævner, at det ikke er et lille skridt i den rigtige retning, hvad angår sikkerhed, men nærmere et gigantisk skridt.Få indblik i udvalgte sikkerheds features i Windows Server Preview aka. Threshold samt nye features i WAP","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Data2001","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Hybrid Cloud Storage with StorSimple and Microsoft Azure","Speakers":"Speakers: Shaun Pillay, Thomas Andersen","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"Data30020","Location":"Sal 2","Description":"This session will provide an overview of the StorSimple and Microsoft Azure hybrid cloud storage solution. The focus will be on existing storage challenges today, what StorSimple is, how it works and how it in conjunction with Microsoft Azure, can help alleviate some of these challenges. We will also be discussing deployment scenarios for a StorSimple solution, including hands-on demos of the product.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Hybrid-Cloud-Storage-with-StorSimple-and-Microsoft-Azure","Track":"Datacenter Modernisering I & II","TrackCode":"data"},{"Title":"Using Windows 10 for mobility","Speakers":"Speakers: Simon May","DateTime":"November 25, 2014 from 1:15PM to 2:30PM","SessionCode":"Win300","Location":"Sal 5","Description":"In this session we will explore how and why Windows is the best platform for your enterprise desktops, laptops, tablets and phones and explore some of the ways that Windows enabled bring your own device. The session will start looking at the Windows 10 UI, you'll discover why modern apps are an IT Pros best friend, why Windows is highly manageable and how to solve the problems posed by information workers and task workers as well as solving some common compatibility issues.","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win300","Track":"Windows Client","TrackCode":"win"},{"Title":"Gør din forretning mobil med Windows 8.1","Speakers":"Speakers: Thomas Martinsen, Jon Bille","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"App30011","Location":"Sal 8","Description":"I Bluefragments laver vi Line Of Business løsninger til Windows 8. Vi lever af at effektivisere processer, gøre eksisterende backends tilgængelige – alt sammen via et indbydende design der virker imødekommende for brugeren. I denne session vil vi give en række konkrete og praktiske eksempler på, hvordan IT afdelingen kan være den drivende og innovative afdeling, der hjælper forretningen med moderne værktøjer. Vi tager udgangspunkt i nogle af vores kundecases og gennemgår nogle af de værktøjer og processer som vi anvender og følger når vi laver Line Of Business løsninger for vores kunder.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Win20011","Track":"App Development","TrackCode":"app"},{"Title":"Windows 10: Deployment","Speakers":"Speakers: Jesper Jensen","DateTime":"November 27, 2014 from 2:45PM to 4:00PM","SessionCode":"win30011","Location":"Sal 5","Description":"Med den kommende frigivelse af Windows 10, vil der være nye og opdaterede metoder til at udrulle Windows. I denne session vil vi gennemgå de nye anbefalinger om hvordan du opgradere eksisterende enheder med simpel In-Place Upgrade, nye værktøjer til at omdanne ny købte computere til fuldt administrerede PCere og hvordan du kan holde Windows 10 opdateret i fremtiden. Vi vil også tale om Windows Store og hvad du får af nye muligheder for udrulning af virksomheds relevante apps.L��r om Windows 10 Deployment.Lær om de nye muligheder med Windows Store Apps.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Windows-10-Deployment","Track":"Windows Client","TrackCode":"win"},{"Title":"Campus Days 2014 Keynote","Speakers":"Speakers: Mary Jo Foley, Rasmus Hald, Simon May","DateTime":"November 25, 2014 from 9:00AM to 10:30AM","SessionCode":"General","Location":"Sal 1","Description":"Igen i år starter vi Microsoft Campus Days med et overblik over hvor Microsoft er lige nu og hvor Microsoft er på vej hen. I år får du overblikket set udefra, når Microsoft kommentatoren Mary-Jo Foley fra ZDNet & All About Microsoft Blog give sit syn på Microsoft... set udefra.Ingen keynote uden demonstration af de nyeste teknologier, og derfor vil du også kunne opleve Simon May fra Microsoft give dig et unikt indblik i hvordan du kan implementere Microsoft strategi om Devices & Services i din virksomhed.Din vært er Rasmus Hald, Teknisk Evangelist fra Microsoft Danmark","Day":"Day 1","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Campus-Days-2014-Keynote","Track":"General","TrackCode":"general"},{"Title":"Customizing Team Foundation Server 2013 for your organization’s needs (Part 1)","Speakers":"Speakers: Mohamed Radwan","DateTime":"November 26, 2014 from 12:00PM to 12:30PM","SessionCode":"VS30012","Location":"Sal 7","Description":"Visual Studio and Team Foundation Server provide a comprehensive toolset for software development teams from planning through deployment. Different teams and organizations might need to customize some objects for different areas so it could fit with their needs. This session will provides a road map for what you can customize, what the difference is between various customization and different ways to perform these customization, We will go through process customization, Kanban board, Agile tools, server side notification, server side plugin, Job Agent Extension, etc. We will both have a look at documented as well as undocumented possibilities.","Day":"Day 2","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/VS30012","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"},{"Title":"Customizing Team Foundation Server 2013 for your organization’s needs (part 2)","Speakers":"Speakers: Mohamed Radwan","DateTime":"November 27, 2014 from 12:00PM to 12:30PM","SessionCode":"VS30013","Location":"Sal 7","Description":"Visual Studio and Team Foundation Server provide a comprehensive toolset for software development teams from planning through deployment. Different teams and organizations might need to customize some objects for different areas so it could fit with their needs. This session will provides a road map for what you can customize, what the difference is between various customization and different ways to perform these customization, We will go through process customization, Kanban board, Agile tools, server side notification, server side plugin, Job Agent Extension, etc. We will both have a look at documented as well as undocumented possibilities.","Day":"Day 3","Link":"http://channel9.msdn.com/Events/Microsoft-Campus-Days/Microsoft-Campus-Days-2014/Customizing-Team-Foundation-Server-2013-for-your-organizations-needs-part-2","Track":"Visual Studio og Team Foundation Server","TrackCode":"vs"}]
